---
title: AnalysisDisplayVectorSettings
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# AnalysisDisplayVectorSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AnalysisDisplayStyleVectorArrowheadScale ArrowheadScale { get; set; }` | `analysisDisplayVectorSettings.ArrowheadScale` | AnalysisDisplayStyleVectorArrowheadScale |
| `Int32 ArrowLineWeight { get; set; }` | `analysisDisplayVectorSettings.ArrowLineWeight` | Int32 |
| `Boolean IsValidObject { get; }` | `analysisDisplayVectorSettings.IsValidObject` | Boolean |
| `Double Rounding { get; set; }` | `analysisDisplayVectorSettings.Rounding` | Double |
| `ElementId TextTypeId { get; set; }` | `analysisDisplayVectorSettings.TextTypeId` | ElementId |
| `AnalysisDisplayStyleVectorOrientation VectorOrientation { get; set; }` | `analysisDisplayVectorSettings.VectorOrientation` | AnalysisDisplayStyleVectorOrientation |
| `AnalysisDisplayStyleVectorPosition VectorPosition { get; set; }` | `analysisDisplayVectorSettings.VectorPosition` | AnalysisDisplayStyleVectorPosition |
| `AnalysisDisplayStyleVectorTextType VectorTextType { get; set; }` | `analysisDisplayVectorSettings.VectorTextType` | AnalysisDisplayStyleVectorTextType |
| `Void Dispose()` | `analysisDisplayVectorSettings.Dispose()` | Void |
| `Boolean IsEqual(AnalysisDisplayVectorSettings)` | `analysisDisplayVectorSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```